// Задание 3.
// Определить, какие из слов «attribute», «класс», «функция», «type»
// невозможно записать в байтовом типе с помощью маркировки b'' (без encode decode).
// Подсказки:
// --- используйте списки и циклы, не дублируйте функции
// --- обязательно!!! усложните задачу, "отловив" и обработав исключение,
// придумайте как это сделать
// """

// """
// Литералы байтов всегда имеют префикс «b» или «B»; 
// они генерируют экземпляр типа байтов вместо типа str. 
// Они могут содержать только символы ASCII.
// ASCII не "понимает" кирилицу. ignore - наименование схемы обработки ошибок, 
// т.е. буквы кирилицы будут игнорированы и получим только "пустое" b''
// Это и используем для проверки возможности записи слова в байтовый тип
// """


Класс  ErrorByByte(исключение):
    __init__ def(self, ошибка):
        self.err = ошибка


= words ['attribute', 'класс', 'функция', 'type']

слова  в  слове  для:
    байты =  word_b(слово, 'ascii', 'игнорировать')
    попробуйте:
        b" == word_b,  если:
            Ошибка  в увеличении количества байтов(
                f'{word} - невозможно записать в байтовом типе')
        печать(word_b)
    ошибка  как  ошибка,  кроме:
        печать(ошибка)